import pytest
import pandas as pd
from datetime import datetime


@pytest.fixture
def testing_dataframe():
    return pd.DataFrame({"Дата платежа": [datetime(2025, 1, 5, 0, 0, 0),
                                          datetime(2024, 12, 20, 0, 0, 0),
                                          datetime(2024, 8, 6, 0, 0, 0),
                                          datetime(2024, 7, 6, 0, 0, 0),],
                         "Категория":["Супермаркеты", "Супермаркеты", "Канцтовары", "Фастфуд"]})


@pytest.fixture
def testing_dataframe_second():
    return pd.DataFrame({"Описание": ["Колхоз", "Магнит", "Незнайка", "Макдак"],
                         "Категория":["Супермаркеты", "Супермаркеты", "Канцтовары", "Фастфуд"]})


@pytest.fixture
def list_of_transaction():
    return [{"Описание":"Колхоз", "Категория": "Супермаркеты"}, {"Описание":"Магнит", "Категория": "Супермаркеты"},
            {"Описание":"Ozon.ru", "Категория": "Различные товары"},
            {"Описание":"Константин Л.", "Категория": "Переводы"}]


@pytest.fixture
def testing_dataframe_3():
    return pd.DataFrame({"Дата платежа": ["27.02.2025", "13.02.2025", "07.01.2025", "16.11.2024"],
                         "Категория":["Супермаркеты", "Переводы", "Канцтовары", "Фастфуд"],
                         "Сумма платежа": [-160.89, -381.48, -349, -120]})


@pytest.fixture
def testing_dataframe_4():
    return pd.DataFrame({"Дата платежа": ["27.02.2025", "13.02.2025", "13.02.2025", "04.02.2025", "11.02.2025",
                                          "25.01.2025", "16.01.2025", "16.01.2025", "23.01.2025", "07.01.2025",
                                          "12.02.2025", "07.01.2025", "16.02.2025", "16.01.2024", "27.12.2024"],
                         "Категория":["Супермаркеты", "Другое", "Канцтовары", "Фастфуд", "Пополнения", "Наличные",
                                      "Переводы", "Переводы", "Наличные", "Каршеринг", "Пополнения", "Переводы",
                                      "Связь", "Косметика", "Каршеринг"],
                         "Сумма платежа": [-160.89, -381.48, -349, -120, 5046, -3000, -1700, 2500, -5000, -257.89, 500,
                                           -250, -40, -689, -9.64]})